#include "SR.h"
#include "prototaype.h"

int main_menu(int e)
{
	printf(" \n  1.Вивести на екран список\n");
	system("ping 1.1.1.1 -n 0.001 -w 0.001 > nul");
	printf("  2.Додати елемент в список\n");
	printf("  3.Видалити елемент з списку за номереом\n");
	printf("  4.Відобразити елемент списку за номером\n");

	printf("  5.Очистити список \n");
	printf("  6.Визначити кiлькiсть РГЗ, що виконує студент за весь\n  перiод навчання в iнститутi у вiдповiдностi до\n  навчального плану\n");
	printf("  7.Завершити роботу \n");
	printf("  8.Перезавантажити програму програму \n");
	printf("  9.Перевірити роботу конструкторів \n");
	printf(" \nваш вибiр: ");
	scanf_s(" %d", &e);

	return e;
}


int yes_and_no(int& t, char p[])
{
	printf("\n\n%s\n ", p);
	printf("так- 1\n ");
	printf("нi- 2\n ");
	printf("вибрана робота :");
	scanf("%i", &t);
	if (t == 2)
	{
		int oo = 12;

	}
	return t;
}
void SR::printTableHead()
{
	printf("\n\n-----------------------------------------------------------------------------------\n");
	printf("|         |  Предмет     |   Темa       | Кiлькiсть балiв  |Строк здачi| Кiлькiсть |\n");
	printf("|         |              |              |за виконане RGZ   |    RGZ    |   завдань |\n  ");
	printf("----------------------------------------------------------------------------------\n");
}
void SR::error( int& a,int& d )
{

	printf("\nНажаль неможливо вiдобразити неiснуючий елемент\n");
	printf("Введiть iнше значення ");
	scanf("%d", &d);
	a = 1;
	
}
